Repository: KDE/krfb
Catalog: po/*/krfb.po
Languages: lt

# NAME OF TRANSLATORS
source: Your names
lt: Dovydas Sankauskas, Moo

# EMAIL OF TRANSLATORS
source: Your emails
lt: laisve@gmail.com, <>

source: New Connection
lt: Naujas ryšys

source: Accept Connection
lt: Priimti ryšį

source: Refuse Connection
lt: Atmesti ryšį

source: Accepted connection from %1
lt: Priimtas ryšys iš %1

source: Received connection from %1, on hold (waiting for confirmation)
lt: Iš %1 gautas prašymas ryšiui, sulaikyta (laukiama patvirtinimo)

source: %1@%2 (shared desktop)
lt: %1@%2 (bendrinamas darbalaukis)

source: Start minimized
lt: Paleisti suskleistą

source: Use the default port for VNC (5900)
lt: Naudoti numatytąjį VNC prievadą (5900)

source: This is the port on which krfb will listen.
lt: Krfb klausysis šio prievado.

source: Announce the service on the local network
lt: Pranešti vietiniame tinkle apie tarnybą

source: Do not store passwords in KWallet
lt: Nesaugoti slaptažodžius KWallet slaptažodinėje

source: Allow remote connections to manage the desktop.
lt: Leisti nuotoliniams ryšiams valdyti jūsų darbalaukį.

source: Allow connections without an invitation.
lt: Leisti užmegzti ryšį be atskiro kvietimo.

source: Password for uninvited connections.
lt: Nekviestiems ryšiams naudojamas slaptažodis.

source: Preferred Frame Buffer Plugin
lt: Pageidaujamas vaizdų atnaujinimo buferio įskiepis

source: Creating a Virtual Monitor from %1
lt: Kuriamas virtualus monitorius iš %1

source: Remote Virtual Monitor
lt: Nuotolinis virtualus monitorius

source: Offer a Virtual Monitor that can be accessed remotely
lt: Siūlyti virtualų monitorių, kuris gali būti pasiektas nuotoliniu būdu

source: Virtual Monitor implementation
lt: Virtualaus monitoriaus įgyvendinimas

source: KDE4 porting
lt: KDE4 realizavimas

source: Original author
lt: Pradinis autorius

source: TightVNC encoder
lt: TightVNC koduotuvas

source: ZLib encoder
lt: Zlib koduotuvas

source: original VNC encoders and protocol design
lt: pradiniai VNC koduotuvai ir protokolo sumanymas

source: Logical resolution of the new monitor
lt: Naujo monitoriaus loginė raiška

source: resolution
lt: raiška

source: Name of the monitor
lt: Monitoriaus pavadinimas

source: name
lt: pavadinimas

source: Password for the client to connect to it
lt: Slaptažodis, reikalingas prisijungimui prie kliento

source: password
lt: slaptažodis

source: The device-pixel-ratio of the device, the scaling factor
lt: Įrenginio pikselių santykis (dpr), mastelio koeficientas

source: The port we will be listening to
lt: Prievadas, kurio bus klausoma

source: number
lt: numeris

source: Your X11 Server does not support the required XTest extension version 2.2. Sharing your desktop is not possible.
lt: Jūsų X11 serveris nepalaiko reikalingos XTest plėtinio versijos 2.2. Darbalaukio bendrinimas yra neįmanomas.

source: Desktop Sharing Error
lt: Darbalaukio bendrinimo klaida

source: Desktop Sharing
lt: Darbalaukio bendrinimas

source: VNC-compatible server to share desktops
lt: Su VNC suderinamas serveris, skirtas bendrinti darbalaukį

source: Telepathy tubes support
lt: Telepathy tubes palaikymas

source: Do not show the invitations management dialog at startup
lt: Paleidimo metu nerodyti kvietimų tvarkymo dialogo

source: Desktop Sharing is not running under an X11 Server or Wayland. Other display servers are currently not supported.
lt: Darbalaukio bendrinimas nėra paleistas X11 serverio ar Wayland aplinkoje. Kiti atvaizdavimo serveriai šiuo metu yra nepalaikomi.

source: Storing passwords in config file is insecure!
lt: Saugoti slaptažodžius konfigūracijos faile yra nesaugu!

source: Enter a new password for Unattended Access
lt: Įveskite naują nestebimosios prieigos slaptažodį

source: Failed to start the krfb server. Desktop sharing will not work. Try setting another port in the settings and restart krfb.
lt: Nepavyko paleisti krfb serverio. Darbalaukio bendrinimas neveiks. Pabandykite nuostatose nustatyti kitokį prievadą ir paleiskite krfb iš naujo.

source: KDE Desktop Sharing
lt: KDE darbalaukio bendrinimas

source: This field contains the address of your computer and the port number, separated by a colon. The address is just a hint - you can use any address that can reach your computer. Desktop Sharing tries to guess your address from your network configuration, but does not always succeed in doing so. If your computer is behind a firewall it may have a different address or be unreachable for other computers.
lt: Šiame laukelyje įrašytas jūsų kompiuterio adresas ir prievado numeris, atskirti dvitaškiu. Šis adresas tėra patarimas – galite naudoti bet kokį adresą, kuriuo yra pasiekiamas jūsų kompiuteris. Darbalaukio bendrinimas mėgins atspėti jūsų kompiuterio adresą pagal tinklo konfigūraciją, bet gali būti, kad ne visada pavyks tai padaryti. Jei jūsų kompiuteris yra už užkardos, jis gali turėti kitą adresą arba būti iš viso nepasiekiamas kitiems kompiuteriams.

source: Any remote user with normal desktop sharing password will have to be authenticated. If unattended access is on, and the remote user provides unattended mode password, desktop sharing access will be granted without explicit confirmation.
lt: Bet kuris nuotolinis naudotojas, turintis įprastą darbalaukio bendrinimo slaptažodį, turės patvirtinti savo tapatybę. Jei nestebimoji prieiga yra įjungta, o nuotolonis naudotojas pateikia nestebimosios veiksenos slaptažodį, tada darbalaukio bendrinimo prieiga jam bus suteikta be jokio aiškaus patvirtinimo.

source: Network
lt: Tinklas

source: Security
lt: Saugumas

source: Screen capture
lt: Ekrano užvaldymas

source: To apply framebuffer plugin setting, you need to restart the program.
lt: Norėdami pritaikyti vaizdų atnaujinimo buferio nuostatą, turite paleisti programą iš naujo.

source: The remote user %1 is now connected.
lt: Nuotolinis naudotojas %1 dabar yra prisijungęs.

source: The remote user %1 disconnected.
lt: Nuotolinis naudotojas %1 atsijungė.

source: Disconnect
lt: Atsijungti

source: Enable Remote Control
lt: Įjungti nuotolinį valdymą

source: Desktop Sharing - disconnected
lt: Darbalaukio bendrinimas – atsijungta

source: Desktop Sharing - connected with %1
lt: Darbalaukio bendrinimas – užmegztas ryšys su %1

source: Desktop Sharing - connected
lt: Darbalaukio bendrinimas – prisijungta

source: Preferred frameb&uffer plugin:
lt: Pageidaujamas vaizdų atna&ujinimo įskiepis:

source: <html><head/><body><p>When using x11, <span style=" font-weight:600;">xcb</span> plugin should be preferred, because it is more performant.<br/><span style=" font-weight:600;">qt</span> plugin is a safe fallback, if for some reason others don't work. But also it is very slow.</p></body></html>
lt: <html><head/><body><p>Naudojant x11, pirmenybė turėtų būti teikiama <span style=" font-weight:600;">xcb</span> įskiepiui, nes jis yra našesnis.<br/><span style=" font-weight:600;">qt</span> įskiepis yra saugus atsarginis variantas tuo atveju, jei kiti dėl tam tikrų priežasčių neveikia. Bet tuo pačiu jis yra labai lėtas.</p></body></html>

source: Allow remote connections to control your desktop
lt: Leisti nuotoliniams ryšiams valdyti jūsų darbalaukį

source: Do not store passwords using KDE wallet
lt: Nesaugoti slaptažodžių naudojant KDE slaptažodinę

source: Use default port
lt: Naudoti numatytąjį prievadą

source: Listening port:
lt: Klausomas prievadas:

source: Attention
lt: Dėmesio

source: Somebody is requesting a connection to your computer. Granting this will allow the remote user to watch your desktop.
lt: Kažkas prašo leisti prisijungti prie jūsų kompiuterio. Patenkinus šį prašymą, nuotoliniam naudotojui bus leista stebėti jūsų darbalaukį.

source: Remote system:
lt: Nuotolinė sistema:

source: If you turn this option on, the remote user can enter keystrokes and use your mouse pointer. This gives them full control over your computer, so be careful. When the option is disabled the remote user can only watch your screen.
lt: Įjungus šią parinktį, nuotolinis naudotojas galės rašyti klaviatūra ir valdyti jūsų pelės rodyklę. Tai leis jam visiškai valdyti jūsų kompiuterį, tad būkite atsargūs. Išjungus šią parinktį, nuotolinis naudotojas galės tik stebėti jūsų ekraną.

source: Allow remote user to &control keyboard and mouse
lt: Leisti nuotoliniam naudotojui &valdyti klaviatūrą ir pelę

source: KDE Desktop Sharing allows you to grant permission to someone at a remote location for viewing and possibly controlling your desktop.
lt: KDE darbalaukio bendrinimas jums leidžia suteikti leidimą kitiems nuotolinėje vietoje esantiems asmenims stebėti ir, galimai, valdyti jūsų darbalaukį.

source: Starts/Stops Remote Desktop Sharing
lt: Pradeda/Sustabdo nuotolinį darbalaukio bendrinimą

source: &Enable Desktop Sharing
lt: Į&jungti darbalaukio bendrinimą

source: Connection Details
lt: Išsamiau apie ryšį

source: &Address
lt: &Adresas

source: More about this address
lt: Daugiau apie šį adresą

source: About
lt: Apie

source: Address required by remote users to connect to your desktop. Click about button on the right for more info.
lt: Adresas, kuris reikalingas nuotoliniams naudotojams tam, kad jie galėtų prisijungti prie jūsų darbalaukio. Norėdami sužinoti daugiau, spustelėkite dešinėje mygtuką „Apie“.

source: &Password
lt: Sla&ptažodis

source: Edit/Save Desktop Sharing Password
lt: Taisyti/Įrašyti darbalaukio bendrinimo slaptažodį

source: Edit
lt: Taisyti

source: Password required by remote users to connect to your desktop. Click the edit button on the right to change password.
lt: Slaptažodis, kuris reikalingas nuotoliniams naudotojams tam, kad jie galėtų prisijungti prie jūsų darbalaukio. Norėdami keisti slaptažodį, spustelėkite dešinėje taisymo mygtuką.

source: TemporaryPassword
lt: LaikinasSlaptažodis

source: Unattended Access allows a remote user with the password to gain control to your desktop without your explicit confirmation.
lt: Nestebimoji prieiga leidžia nuotoliniam naudotojui, turinčiam slaptažodį, valdyti jūsų darbalaukį be aiškaus jūsų patvirtinimo.

source: Unattended Access
lt: Nestebimoji prieiga

source: Unattended Access allows a remote user with the password to gain control to your desktop without your explicit confirmation. Click "About" button on right to know more.
lt: Nestebimoji prieiga leidžia nuotoliniam naudotojui, turinčiam slaptažodį, valdyti jūsų darbalaukį be aiškaus jūsų patvirtinimo. Norėdami sužinoti daugiau, spustelėkite dešinėje mygtuką „Apie“.

source: Know more about Unattended Access
lt: Daugiau sužinoti apie nestebimąją prieigą

source: Starts/Stops unattended access to your desktop. Click on button on right to change password, and "About" button to know more.
lt: Paleidžia/Sustabdo nestebimąją prieigą prie jūsų darbalaukio. Norėdami pakeisti slaptažodį, spustelėkite mygtuką dešinėje, o norėdami sužinoti daugiau, spustelėkite mygtuką „Apie“.

source: Enable &Unattended Access
lt: Įj&ungti nestebimąją prieigą

source: Change password for Unattended Access
lt: Keisti nestebimosios prieigos slaptažodį

source: &Change Unattended Password
lt: &Keisti nestebimosios prieigos slaptažodį
